Ran Plan for 2 projects:

1. dir: `vpc-demo-2` workspace: `default`
1. dir: `vpc-demo` workspace: `default`

### 1. dir: `vpc-demo-2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_subnet.private_subnets[0] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-076ef7c0362fe05fb" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.2.4.0/24" -> "10.20.4.0/24" # forces replacement
      ~ id                                             = "subnet-076ef7c0362fe05fb" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-1"
        }
      ~ vpc_id                                         = "vpc-0458fe504e7f526c7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[1] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-098ee533a7d06b052" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.2.5.0/24" -> "10.20.5.0/24" # forces replacement
      ~ id                                             = "subnet-098ee533a7d06b052" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-2"
        }
      ~ vpc_id                                         = "vpc-0458fe504e7f526c7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[2] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-078406f312422d43a" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.2.6.0/24" -> "10.20.6.0/24" # forces replacement
      ~ id                                             = "subnet-078406f312422d43a" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-3"
        }
      ~ vpc_id                                         = "vpc-0458fe504e7f526c7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[0] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-051b03ec505b9bf06" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.2.1.0/24" -> "10.20.1.0/24" # forces replacement
      ~ id                                             = "subnet-051b03ec505b9bf06" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-1"
        }
      ~ vpc_id                                         = "vpc-0458fe504e7f526c7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[1] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-08fb7159334159e8e" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.2.2.0/24" -> "10.20.2.0/24" # forces replacement
      ~ id                                             = "subnet-08fb7159334159e8e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-2"
        }
      ~ vpc_id                                         = "vpc-0458fe504e7f526c7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[2] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0dfc26855d9364dc2" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.2.3.0/24" -> "10.20.3.0/24" # forces replacement
      ~ id                                             = "subnet-0dfc26855d9364dc2" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-3"
        }
      ~ vpc_id                                         = "vpc-0458fe504e7f526c7" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:630209571978:vpc/vpc-0458fe504e7f526c7" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.2.0.0/16" -> "10.20.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-02db9f1da2acb96ae" -> (known after apply)
      ~ default_route_table_id               = "rtb-03ae165ab42d3afde" -> (known after apply)
      ~ default_security_group_id            = "sg-03d9fa8017abf38f6" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0d066b25db65ca600" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0458fe504e7f526c7" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-03ae165ab42d3afde" -> (known after apply)
      ~ owner_id                             = "630209571978" -> (known after apply)
        tags                                 = {
            "Name" = "Project VPC Demo2"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo-2`
</details>
Plan: 7 to add, 0 to change, 7 to destroy.

---
### 2. dir: `vpc-demo` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Project VPC IGW Demo"
        }
      + tags_all = {
          + "Name" = "Project VPC IGW Demo"
        }
      + vpc_id   = "vpc-038de61bc566c92be"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`